app/controllers/colours_controller.rb

SELECT "colours".* FROM "colours"
---
  def index
    @colours = Colour.all

INSERT INTO "colours" ("sound_id", "name", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["sound_id", 1], ["name", "#e02b2b"], ["user_id", 2], ["created_at", 2017-02-22 11:21:22 UTC], ["updated_at", 2017-02-22 11:21:22 UTC]]
---
  def create
    @colour = current_user.colours.new(colour_params)

    if @colour.save

SELECT  "colours".* FROM "colours" WHERE "colours"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_colour
      @colour = Colour.find(params[:id])