app/controllers/sounds_controller.rb

SELECT "sounds".* FROM "sounds"
---
  def index
    @sounds = Sound.all

SELECT  "sounds".* FROM "sounds" WHERE "sounds"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_sound
      @sound = Sound.find(params[:id])